#include <stdio.h>

int main(){
    int a;
    int b;
    int *p;
    int *p_1;
    int *p_2;
    scanf("%d %d",&a,&b);
    p_1=&a;
    p_2=&b;
    if (p_1>p_2){
        p=p_1;//符合p_1>P_2的，将p_1的值赋值给p
        p_1=p_2;//将p_2的值赋值给p_1
        p_2=p;//将p的值赋值给p_2，完成交换
        //或写成：
        //p_1=&b;p_2=&a;
        //这样写可以不使用第三个变量p来完成交换，使程序更加简洁。
    }else{
        p=p_2;//不符合p_1>p_2的，将p_2的值赋值给p
        p_2=p_1;//将p_1的值赋值给p_2
        p_1=p;//将p的值赋值给p_1，完成交换
        //或写成：
        //p_1=&a;p_2=&b;
        //这样写可以不使用第三个变量p来完成交换，使程序更加简洁。
    }
    printf("a:%d \nb:%d\n" ,a,b);
    printf("p_1:%d \np_2:%d\n",*p_1,*p_2);
}